<?php
    $x = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]];

    // Задача: Посчитать сумму всех элементов двумерного массива.
    // Этот скрипт пробегает по всем элементам матрицы построчно (сначала строки, потом столбцы) и суммирует их.
    $s = 0;
    for ($i=0; $i < 3; $i++) {
        for ($j=0; $j < 3; $j++) {
            $s += $x[$i][$j];
        }
    }
    echo $s, '<br>---<br>';

    // Задача: Аналогично первой, посчитать сумму всех элементов, 
    // но пройтись по столбцам, а внутри по строкам. Итог сумма будет та же.
    // Использование другого порядка обхода массива.
    $s = 0;
    for ($j=0; $j < 3; $j++) {
        for ($i=0; $i < 3; $i++) {
            $s += $x[$i][$j];
        }
    }
    echo $s, '<br>---<br>';

    // Задача: Посчитать суммы каждой строки отдельно.
    // Внешний цикл пробегает по строкам,
    // внутренний - по столбцам текущей строки, суммируя значения.
    for ($i=0; $i < 3; $i++) {
        $s = 0;
        for ($j=0; $j < 3; $j++) {
            $s += $x[$i][$j];
        }
        echo $s, '<br>';
    }
    echo '---<br>';

    // Задача: Посчитать суммы каждого столбца отдельно.
    // Внешний цикл - по столбцам, внутренний - по всем строкам текущего столбца.
    for ($j=0; $j < 3; $j++) {
        $s = 0;
        for ($i=0; $i < 3; $i++) {
        $s += $x[$i][$j];
        }
        echo $s, '<br>';
    }
?>