<?php
$a[] = "25 111-11-11 life:)";
$a[] = "33 ***-**-** MTC";
$a[] = "44 ***-**-** Velcom";
$a[] = "29 ***-**-** Velcom";
$a[] = "29 ***-**-** MTC";
$a[] = "29 ***-**-** Velcom";
$a[] = "29 ***-**-** MTC";
$a[] = "29 ***-**-** Velcom";
$a[] = "29 ***-**-** MTC";
$a[] = "29 ***-**-** MTC";
$a[] = "29 ***-**-** Velcom";
$a[] = "15 ***-**-** Гродненская область";
$a[] = "16 ***-**-** Брестская область";
$a[] = "17 ***-**-** Минская область";
$a[] = "21 ***-**-** Витебская область";
$a[] = "22 ***-**-** Могилевская область";
$a[] = "23 ***-**-** Гомельская область";
$q = $_REQUEST["q"] ?? "";
$hint = "";
if($q !== "") {
    $len=strlen($q);
    foreach($a as $phone) {
        if(strstr($q, mb_substr($phone, 0, $len))){
            if($hint === "") $hint = $phone;
            else $hint .= "<br> $phone";
        }
    }
}
echo $hint === "" ? "Нет вариантов" : $hint;
?>